[
  {
    "week": 1,
    "date": "2024-12-23",
    "reading": "Matthew 1-2",
    "version": "The Message",
    "summary": "The birth and early life of Jesus",
    "text": "This week’s passage from Matthew 1-2 in The Message translation reveals the heart of the gospel story: the birth and early life of jesus.",
    "reflection": "The birth and early life of Jesus invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—the birth and early life of jesus—challenge or comfort you in your current season of life?"
  },
  {
    "week": 2,
    "date": "2024-12-30",
    "reading": "Matthew 3-4",
    "version": "The Message",
    "summary": "John the Baptist and Jesus' temptation",
    "text": "This week’s passage from Matthew 3-4 in The Message translation reveals the heart of the gospel story: john the baptist and jesus' temptation.",
    "reflection": "John the Baptist and Jesus' temptation invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—john the baptist and jesus' temptation—challenge or comfort you in your current season of life?"
  },
  {
    "week": 3,
    "date": "2025-01-06",
    "reading": "Matthew 5-7",
    "version": "The Message",
    "summary": "The Sermon on the Mount",
    "text": "This week’s passage from Matthew 5-7 in The Message translation reveals the heart of the gospel story: the sermon on the mount.",
    "reflection": "The Sermon on the Mount invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—the sermon on the mount—challenge or comfort you in your current season of life?"
  },
  {
    "week": 4,
    "date": "2025-01-13",
    "reading": "Matthew 8-9",
    "version": "The Message",
    "summary": "Miracles of Jesus",
    "text": "This week’s passage from Matthew 8-9 in The Message translation reveals the heart of the gospel story: miracles of jesus.",
    "reflection": "Miracles of Jesus invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—miracles of jesus—challenge or comfort you in your current season of life?"
  },
  {
    "week": 5,
    "date": "2025-01-20",
    "reading": "Matthew 10",
    "version": "The Message",
    "summary": "Mission of the Twelve",
    "text": "This week’s passage from Matthew 10 in The Message translation reveals the heart of the gospel story: mission of the twelve.",
    "reflection": "Mission of the Twelve invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—mission of the twelve—challenge or comfort you in your current season of life?"
  },
  {
    "week": 6,
    "date": "2025-01-27",
    "reading": "Matthew 11-12",
    "version": "The Message",
    "summary": "Jesus' teaching and opposition",
    "text": "This week’s passage from Matthew 11-12 in The Message translation reveals the heart of the gospel story: jesus' teaching and opposition.",
    "reflection": "Jesus' teaching and opposition invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—jesus' teaching and opposition—challenge or comfort you in your current season of life?"
  },
  {
    "week": 7,
    "date": "2025-02-03",
    "reading": "Matthew 13",
    "version": "The Message",
    "summary": "Parables of the Kingdom",
    "text": "This week’s passage from Matthew 13 in The Message translation reveals the heart of the gospel story: parables of the kingdom.",
    "reflection": "Parables of the Kingdom invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—parables of the kingdom—challenge or comfort you in your current season of life?"
  },
  {
    "week": 8,
    "date": "2025-02-10",
    "reading": "Matthew 14-15",
    "version": "The Message",
    "summary": "Feeding and healing",
    "text": "This week’s passage from Matthew 14-15 in The Message translation reveals the heart of the gospel story: feeding and healing.",
    "reflection": "Feeding and healing invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—feeding and healing—challenge or comfort you in your current season of life?"
  },
  {
    "week": 9,
    "date": "2025-02-17",
    "reading": "Matthew 16-17",
    "version": "The Message",
    "summary": "Peter's confession and transfiguration",
    "text": "This week’s passage from Matthew 16-17 in The Message translation reveals the heart of the gospel story: peter's confession and transfiguration.",
    "reflection": "Peter's confession and transfiguration invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—peter's confession and transfiguration—challenge or comfort you in your current season of life?"
  },
  {
    "week": 10,
    "date": "2025-02-24",
    "reading": "Matthew 18-20",
    "version": "The Message",
    "summary": "Teaching on discipleship",
    "text": "This week’s passage from Matthew 18-20 in The Message translation reveals the heart of the gospel story: teaching on discipleship.",
    "reflection": "Teaching on discipleship invites us to consider how Jesus' actions and words shaped the lives of those around him. His presence disrupts, heals, and reveals. When we engage with these scriptures, we’re not just reading history, we’re allowing our own lives to be questioned and formed.",
    "question": "How does this week's reading—teaching on discipleship—challenge or comfort you in your current season of life?"
  }
]